[
    {
        "hex": "c99975274d0c66f48fc6249ba7a8f7f5173b378ee4a6acdf917b21dcd703de85",
        "url": "/visualizing-complex-functions",
        "commenterIdx": null,
        "markdown": "Your domain coloring looks truly excellent! The font looks very much like matplotlib, do you have an example script?",
        "html": "",
        "parentHex": "root",
        "childIndices": [1],
        "score": 2,
        "state": "approved",
        "creationDate": "2021-07-06T20:19:06.262956Z",
        "direction": 0,
        "deleted": false
    },
    {
        "hex": "1aaa394f25941342ceb6c8bebf6794afbce5f6eb85ad835976934984478c927e",
        "url": "/visualizing-complex-functions",
        "commenterIdx": 0,
        "markdown": "Thanks, yeah I still have the scripts and they indeed use matplotlib, but they were never meant to see the light of day.\n\nhttps://github.com/vankessel/sandbox/tree/master/graph\n\nIf I remember correctly `interp.py` and `interp2.py` are similar scripts used for these visuals. `interp.py` generated most of these interpolations. `interp2.py` for the interpolations that don't bounce back and forth between identity and the mapping. You can ignore `main.py`\n\nHere's a short summary I've given others who've asked about this code:\n\n- Create a 2D grid of points on the complex plane (interp.py line 25)\n- Transform those points using the function (interp.py line 37)\n- Interpolate from f(z) = z to g(z) (interp.py line 81)\n- Apply the colors (interp.py line 83)\n- Use matplotlib to display the data and save a frame to a temporary directory (interp.py line 92)\n- Combine those frames into a video (interp.py line 111)",
        "html": "",
        "parentHex": "c99975274d0c66f48fc6249ba7a8f7f5173b378ee4a6acdf917b21dcd703de85",
        "childIndices": null,
        "score": 1,
        "state": "approved",
        "creationDate": "2021-07-11T20:32:26.210787Z",
        "direction": 0,
        "deleted": false
    },
    {
        "hex": "e983ad09123159e5c573a730061cdcc623abcdbbc3629c912c370b696870df56",
        "url": "/disprove-quantum-immortality",
        "commenterIdx": null,
        "markdown": "Really cool article! And a really thorough explanation of the proof. And even though you pretty much just proved that quantum immortality can never happen, can I ask some questions about your idea of perfect quantum immortality used in your proof just to expand my own understanding of your reasoning in the proof? I believe you're implying that according to this idea, every single conscious being in existence will only live in realities in which they can live the longest life possible, and every quantum event that ever happens will accommodate that.  I'm guessing that means that theoretically, this reality is a reality that is part of the timeline that will help everyone who is living in this reality live the longest. I'm guessing that would mean, when everyone else sees a person die, they have moved on to a new reality that is the next part of their personal timeline in which they live the longest. However, I could be miles off on this, but I was wondering if you were implying something very different, or if not, could the following at least be true? Were you saying that everyone's timelines are completely isolated because they \"funnel you down the branch of reality in which you live your longest life\" and no timelines contain the same realities in them, seeing as they were funneled down for each individual? In this case, would no conscious individual experience the same reality? Would other people living in one person's reality not be conscious and just be copies, since a conscious being can only experience the premade reality in which they live the longest? I could very well be coming to the wrong conclusions, and I'm guessing that none of the latter is implied, and that you are saying conscious beings in perfect quantum immortality can experience the same realities just so long as they are part of all their \"perfect\" timelines? Would this idea, if true, affect the proof you created in any way? The idea is probably so off, seeing as I don't think you're implying this and there is no reason for this to be true. but I thought I would ask if it is possible and if it would affect the proof anyways just out of curiosity :)",
        "html": "",
        "parentHex": "root",
        "childIndices": null,
        "score": 3,
        "state": "approved",
        "creationDate": "2021-06-02T02:11:40.825507Z",
        "direction": 0,
        "deleted": false
    },
    {
        "hex": "cf558e6f48ee3d92f7b3ef775a929adfa4956c2ce625a98afe348c3c75c0fea3",
        "url": "/disprove-quantum-immortality",
        "commenterIdx": null,
        "markdown": "Quantum immortality does not require the many worlds interpretation. Any multiverse will do. In particular, quantum immortality is absolutely true due to the mathematical multiverse (a.k.a. the Tegmark level IV multiverse), and there's a simple experiment you can run to test it: are you experiencing anything right now?\n\nQuantum immortality is nothing more than the anthropic principle. Future versions of \"you\" exist because everything exists. You can verify this easily: existence must carry no information (either everything exists or nothing exists), I exist, so everything must exist. Furthermore, future versions of \"you\" will look back at their history and notice they survived. Why? Because they had to by definition.\n\nWhat this means in practice is that the probabilities you observe are conditioned on your existence. In normal day-to-day life, this will have little effect, but it definitely does have measurable effects, and you don't have to risk your life to measure them. SPOILER ALERT: I have measured them, and I'm the protagonist. Sorry. However, you can take solace in the knowledge that I am wrong in almost every version where I say this -- just not the version I'm experiencing right now (that is, the path of experiences I refer to as \"me\").\n\nYour experiment won't work for numerous reasons. The most important is that the probability of generating a meaningful random sequence is incredibly small and has no reason to be correlated with my survival. Even if there were some correlation, the probability of getting a meaningful message after conditioning on my existence is still incredibly small. It's much more likely that I would continue to survive for more mundane (and probable) reasons.\n\nFor instance, advanced aliens who believe in quantum immortality and worship \"The Observer\" (me) could come down out of the sky, upload my consciousness, and safeguard it with all their technological prowess. That would probably extend my life a lot more than receiving a \"tweet from the void.\" But it's not likely.\n\nHow do we know what's likely and what's not? Science! It's part of the definition of me, and we can discover it through observation. I am the equivalence class of my priors. There is a natural bijection between observers (me) and observed universes (my experiences). In fact, I am only well-defined up to the universe in which I live because my only access to information about me is through my experiences! Everything that happens -- physics, chemistry, biology -- the entire natural world -- it's just part of me!\n\nThat's why I prefer to study math: I'm not conceited :P",
        "html": "",
        "parentHex": "root",
        "childIndices": null,
        "score": 1,
        "state": "approved",
        "creationDate": "2021-04-27T23:26:32.548759Z",
        "direction": 0,
        "deleted": false
    },
    {
        "hex": "cb46983914a1bf4676e19811691ea06cd2b50c7e17331baf2e676b46566c5984",
        "url": "/disprove-quantum-immortality",
        "commenterIdx": null,
        "markdown": "Hi Kara,\n\nThis is phenomenally cool. Thank you. Just a word on your last sentence.  Maybe immortality wouldn't be exhausting if existing at atomic level for many years is more zen than being a much more complex being. Does that make sense or am I talking crazy? :)",
        "html": "",
        "parentHex": "root",
        "childIndices": [5],
        "score": 2,
        "state": "approved",
        "creationDate": "2021-02-28T23:03:42.548203Z",
        "direction": 0,
        "deleted": false
    },
    {
        "hex": "0a7547208f8210e6284010e4261639cbec15577f34160212710ff4dc333ec5fa",
        "url": "/disprove-quantum-immortality",
        "commenterIdx": 0,
        "markdown": "Hey, yeah you make sense. If atoms have an experience I would expect it to be zen-like. Eternity is probably no big deal if you get rid of thought and leave only present awareness. Sort of like losing track of time when entering a flow state.",
        "html": "",
        "parentHex": "cb46983914a1bf4676e19811691ea06cd2b50c7e17331baf2e676b46566c5984",
        "childIndices": [6],
        "score": 1,
        "state": "approved",
        "creationDate": "2021-03-01T02:00:54.658569Z",
        "direction": 0,
        "deleted": false
    },
    {
        "hex": "829b437da8ab34c7e9ed50dc4a0da0e94a2e1f2c60733355090d0e78c0df0681",
        "url": "/disprove-quantum-immortality",
        "commenterIdx": null,
        "markdown": "Exactly! You elaborated it very well.",
        "html": "",
        "parentHex": "0a7547208f8210e6284010e4261639cbec15577f34160212710ff4dc333ec5fa",
        "childIndices": null,
        "score": 1,
        "state": "approved",
        "creationDate": "2021-03-01T10:34:58.21203Z",
        "direction": 0,
        "deleted": false
    }
]